In [1]:
import numpy as np
import pandas as pd

In [4]:
first_series = pd.Series(list('abcdef'))
print(list('abcdef'))

['a', 'b', 'c', 'd', 'e', 'f']

In [5]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [6]:
np_country = np.array(['Norway', 'Sweden', 'Germany', 'Spain', 'USA', 'France', 'UK'])
s_country = pd.Series(np_country)

In [7]:
print(s_country)

0     Norway
1     Sweden
2    Germany
3      Spain
4        USA
5     France
6         UK
dtype: object

In [9]:
dict_country_gpd = pd.Series([52000, 40000,80000,10000,100000,30000,50000], index = ['Norway', 'Sweden', 'Germany', 'Spain', 'USA', 'France', 'UK'])

In [10]:
print(dict_country_gpd)

Norway      52000
Sweden      40000
Germany     80000
Spain       10000
USA        100000
France      30000
UK          50000
dtype: int64

In [19]:
print('\nindex: ',dict_country_gpd[0])
print('\nindex:\n',dict_country_gpd[0:5])
print('\nLoc: \n', dict_country_gpd.loc['UK'])
print('\niLoc: \n',dict_country_gpd.iloc[0])

index:  52000

index:
 Norway      52000
Sweden      40000
Germany     80000
Spain       10000
USA        100000
dtype: int64

Loc:
 50000

iLoc:
 52000

In [20]:
olypic_data_dict = {'Lnd': {2012:205}, 'Beijin': {2008:204}}
df_olympic_data_dict = pd.DataFrame(olypic_data_dict)
df_olympic_data_dict

        Lnd  Beijin
2012  205.0     NaN
2008    NaN   204.0

In [23]:
olympic_series_participation = pd.Series([205,204,201,200,197], index = [2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney','Atlanta'],index = [2012,2008,2004,2000,1996])

In [24]:
df_olympic_series = pd.DataFrame({'No. of Partificapting Countries':olympic_series_participation,
                                 'Host Cities': olympic_series_country})

In [25]:
df_olympic_series

      No. of Partificapting Countries Host Cities
2012                              205      London
2008                              204     Beijing
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta

In [26]:
df_olympic_series.describe

<bound method NDFrame.describe of       No. of Partificapting Countries Host Cities
2012                              205      London
2008                              204     Beijing
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta>

In [29]:
df_olympic_series.head(2)

      No. of Partificapting Countries Host Cities
2012                              205      London
2008                              204     Beijing

In [30]:
df_olympic_series.tail(3)

      No. of Partificapting Countries Host Cities
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta

In [31]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [32]:
df_olympic_series.columns

Index(['No. of Partificapting Countries', 'Host Cities'], dtype='object')

In [33]:
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [34]:
df_olympic_series.loc[2012]

No. of Partificapting Countries       205
Host Cities                        London
Name: 2012, dtype: object

In [35]:
df_olympic_series.iloc[0:2]

      No. of Partificapting Countries Host Cities
2012                              205      London
2008                              204     Beijing

In [39]:
df_olympic_series.iat[3,1]

'Sydney'

In [40]:
# HANDLE NAN VALUES 

#dropna()
#fillna()
#fill when joining through add function, fill_value attribute = x

In [45]:
family_series = pd.Series(['Aina','Paula', 'Nina', 'Catalina', 'Mateu'], index= ['me', 'cousin', 'sister', 'parent', 'parent'])
friend_series = pd.Series(['Paul', 'Alex', 'Madi', 'Nina', 'Ana'], index = ['friend', 'friend', 'friend', 'sister', 'cousin'])

me            Aina
cousin       Paula
sister        Nina
parent    Catalina
parent       Mateu
dtype: object
friend    Paul
friend    Alex
friend    Madi
sister    Nina
cousin     Ana
dtype: object

In [47]:
relatives_series_nan = family_series + friend_series
relatives_series_nan.head()

cousin    PaulaAna
friend         NaN
friend         NaN
friend         NaN
me             NaN
dtype: object

In [48]:
relatives_series_nan.dropna()

cousin    PaulaAna
sister    NinaNina
dtype: object

In [49]:
relatives_series_nan.fillna('not family')

cousin      PaulaAna
friend    not family
friend    not family
friend    not family
me        not family
parent    not family
parent    not family
sister      NinaNina
dtype: object

In [56]:
relatives_series = friend_series.add(family_series, fill_value = ' Not friends ')
relatives_series.head(10)

cousin                 AnaPaula
friend        Paul Not friends
friend        Alex Not friends
friend        Madi Not friends
me             Not friends Aina
parent     Not friends Catalina
parent        Not friends Mateu
sister                 NinaNina
dtype: object

In [57]:
# DATA OPERATIONS - FUNCITONS APPLIED TO DATA

In [64]:
def movie_grade(rating):
    if rating >= 9:
        return 'A'
    elif rating >= 7:
        return 'B'
    elif rating >= 5:
        return 'C'
    else:
        return 'F (Do not fucking watch it, it sucks)'

In [65]:
print(movie_grade(5))

C

In [72]:
df_movie_rating = pd.DataFrame({'Tom': {'Movie 1':5, 'Movie 2':6.7}, 'Ben': {'Movie 1':4, 'Movie 2':9.7}, 'Paul': {'Movie 1':7, 'Movie 2':8.7}})
df_movie_rating.head()

         Tom  Ben  Paul
Movie 1  5.0  4.0   7.0
Movie 2  6.7  9.7   8.7

In [73]:
df_movie_rating.applymap(movie_grade)

        Tom                                    Ben Paul
Movie 1   C  F (Do not fucking watch it, it sucks)    B
Movie 2   C                                      A    B

In [77]:
df_test_scores = pd.DataFrame({'Test 1': [95,85,66,80,92,97], 'Test 2': [75,95,96,50,62,77]}, index = ['jack', 'paul', 'aina', 'alex', 'madi', 'sarah'])
df_test_scores.head()

      Test 1  Test 2
jack      95      75
paul      85      95
aina      66      96
alex      80      50
madi      92      62

In [78]:
df_test_scores.max()

Test 1    97
Test 2    96
dtype: int64

In [79]:
df_test_scores.mean()

Test 1    85.833333
Test 2    75.833333
dtype: float64

In [80]:
df_test_scores.std()

Test 1    11.617516
Test 2    18.082220
dtype: float64

In [81]:
# GROUP BY

In [83]:
df_president_names = pd.DataFrame({'first': ['Aina','George', 'Bill', 'Ronald', 'Jimmy', 'George'], 'last': ['Tersol','Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})
df_president_names.head()

    first     last
0    Aina   Tersol
1  George     Bush
2    Bill  Clinton
3  Ronald    Regan
4   Jimmy   Carter

In [87]:
df_president_names_grouped = df_president_names.groupby('first')
df_president_names_grouped.head()

    first        last
0    Aina      Tersol
1  George        Bush
2    Bill     Clinton
3  Ronald       Regan
4   Jimmy      Carter
5  George  Washington

In [86]:
df_president_names_grouped.get_group('George')

    first        last
1  George        Bush
5  George  Washington

In [94]:
#STANDARDIZATION

def standardize_tests(test):
    return (test-test.mean())/test.std()

def feature_scaling(test):
    return (test/test.max())

In [95]:
standardize_tests(df_test_scores['Test 1'])

jack     0.789038
paul    -0.071731
aina    -1.707192
alex    -0.502115
madi     0.530808
sarah    0.961192
Name: Test 1, dtype: float64

In [97]:
feature_scaling(df_test_scores)

         Test 1    Test 2
jack   0.979381  0.781250
paul   0.876289  0.989583
aina   0.680412  1.000000
alex   0.824742  0.520833
madi   0.948454  0.645833
sarah  1.000000  0.802083

In [98]:
def standardize_test_scores(df):
    return df.apply(standardize_tests)

In [99]:
standardize_tests(df_test_scores)

         Test 1    Test 2
jack   0.789038 -0.046086
paul  -0.071731  1.059973
aina  -1.707192  1.115276
alex  -0.502115 -1.428659
madi   0.530808 -0.765024
sarah  0.961192  0.064520

In [100]:
#DEMO - student datasets

In [101]:
df_student_math = pd.DataFrame({'student': ['Tom','Jack','Dan','Ram', 'Jeff', 'David' ], 'ID':[10,56,31,85,9,22]})
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'], 'ID':[10,12,22]})

In [102]:
pd.merge(df_student_math, df_student_science) #inner join

  student  ID
0     Tom  10
1   David  22

In [103]:
pd.merge(df_student_math, df_student_science, on= 'student') #inner join on student

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [104]:
pd.merge(df_student_math, df_student_science, on= 'ID', how= 'left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [106]:
pd.concat([df_student_math, df_student_science], ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [107]:
df_student_survey_data = pd.DataFrame({'student': ['Tom','Jack','Tom','Ram', 'Jeff', 'Jack' ], 'ID':[10,56,10,85,9,56]})

In [108]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [110]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [111]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [112]:
# SQL

In [113]:
import sqlite3

In [131]:
create_table = """
CREATE TABLE student_score
(Id Integer, Name VARCHAR(20), Math REAL, 
Science REAL);
"""

In [132]:
executeSQL = sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit()

In [133]:
SQL_query = executeSQL.execute('select * from student_score')

In [134]:
resultset = SQL_query.fetchall()

In [135]:
resultset

[]

In [136]:
insertSQL = [(10, 'Jack', 85,92), (29,'Tom', 73,89), (65,'Ram',65.5, 77), (5, 'Steve', 55,91)]

In [137]:
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [138]:
SQL_query = executeSQL.execute('select * from student_score')

In [139]:
resultset = SQL_query.fetchall()

In [142]:
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [157]:
next(zip(*SQL_query.description)) #list of lists, 
#when doing zip it returns 4 iterables, hence next will return the first element of each 
#it is actually one iterable (ALEX) but I understand myself, it is like a matrix where you go through each column

('Id', 'Name', 'Math', 'Science')

In [155]:
df_student_records = pd.DataFrame(resultset, columns = next(zip(*SQL_query.description)))

In [156]:
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0